%%%-------------------------------------------------------------------
%%% @doc
%%% 应用启动回调模块
%%% (负责启动顶层监督进程,建立监听,开始等待接受连接等操作)
%%% @end
%%%-------------------------------------------------------------------

-module(tcp_server_app).

-behaviour(application).

%% Application callbacks
-export([start/2,
         stop/1]).

%%%===================================================================
%%% Application callbacks
%%%===================================================================

%%--------------------------------------------------------------------
%% @private
%% @doc
%% 应用启动时(用application:start/[1,2]),将回调这个函数.
%% (负责启动顶层监督进程)
%% @end
-spec start(StartType, StartArgs) -> Result when
    StartType   :: application:start_type(),
    StartArgs   :: term(),
    Result      :: {ok, pid()} | {error, Reason},
    Reason      :: term().
%%--------------------------------------------------------------------
start(_StartType, _StartArgs) ->
    tcp_server_sup:start_link().


%%--------------------------------------------------------------------
%% @private
%% @doc
%% 应用关闭时,将回调这个函数.
%% (暂时不关注)
%% @end
%%--------------------------------------------------------------------
stop(_State) ->
    ok.

%%%===================================================================
%%% Internal functions
%%%===================================================================
